InformationRegisters/isc_ЛогСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>isc_ЛогСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмОбъема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмМассы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмДлин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/isc_МетодХраненияВГХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>isc_МетодХраненияВГХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеквизитыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыУпаковки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитыХарактеристики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияХарактеристики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОбъектаХранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/isc_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>isc_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыХранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодХраненияВГХ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.isc_МетодХраненияВГХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство_ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствиеУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдУпаковки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/WSInfoscan/Ext/Module.bsl
Функция CheckBarcode(Barcode, Status, Comment)
	Запрос = Новый Запрос("ВЫБРАТЬ
	         |	ШтрихкодыОбъектовХранения.ОбъектХранения КАК ОбъектХранения
	         |ИЗ
	         |	РегистрСведений.ШтрихкодыОбъектовХранения КАК ШтрихкодыОбъектовХранения
	         |ГДЕ
	         |	ШтрихкодыОбъектовХранения.Штрихкод = &Штрихкод");
	Запрос.УстановитьПараметр("Штрихкод", Barcode);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда	
		Status = "OK";
		Comment = Строка(Результат.ОбъектХранения); 
	Иначе
		Status = "ER";
		Comment = "Штрихкод не найден"; 	
	КонецЕсли;
	Настройки = Справочники.isc_Настройки.ПолучитьНастройки();// НайтиПоКоду("000000001");
	Если Настройки.Логирование Тогда
		ЗаписатьЛог(Barcode,,,,, "Проверка штрихкода. " +  Status + "." + Comment);
	КонецЕсли;	
	Возврат "";

КонецФункции

Функция SaveParametrs(Barcode, Status, Comment, Length, Height, Width, Weight, ItemType)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                     |	ШтрихкодыОбъектовХранения.ОбъектХранения КАК ОбъектХранения,
	                     |	ШтрихкодыОбъектовХранения.Упаковка КАК Упаковка
	                     |ИЗ
	                     |	РегистрСведений.ШтрихкодыОбъектовХранения КАК ШтрихкодыОбъектовХранения
	                     |ГДЕ
	                     |	ШтрихкодыОбъектовХранения.Штрихкод = &Штрихкод");
	Запрос.УстановитьПараметр("Штрихкод", Barcode);
	Результат = Запрос.Выполнить().Выбрать();
	Настройки = Справочники.isc_Настройки.ПолучитьНастройки();	
	сткВходныеПараметры = Новый Структура("Length, Height, Width, Weight", Length, Height, Width, Weight);
	//сткВходныеПараметрыРУсские = Новый Структура("Length, Height, Width, Weight", "Ширина", "Высота", "Глубина", "Вес");
	Если Результат.Следующий() Тогда 
		//Каждое измерение может храниться в различных реквизитах
		Для Каждого стзМетодыХранения Из Настройки.МетодыХранения Цикл
			Если стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыУпаковки Тогда
				
				Упаковка = Результат.Упаковка;//ПолучитьУпаковкуИзСоответствияУпаковкам(Результат.Номенклатура, Настройки.СоответствиеУпаковок.Найти(Число(ItemType),"ИдУпаковки"));
				Попытка
					//Если ЗначениеЗАполнено(ItemType) И ЗначениеЗаполнено(Упаковка) Тогда 
					//	ОбъектХранения = Упаковка.ПолучитьОбъект();
					//Иначе 
						ОбъектХранения = Результат.Упаковка.ПолучитьОбъект();	
					//КонецЕсли;
					ОбъектХранения[стзМетодыХранения.Свойство_ИмяРеквизита] = сткВходныеПараметры[стзМетодыХранения.ИмяСвойства];
					ОбъектХранения.Записать();
				Исключение
					ЗаписатьЛог(Barcode, Length , Height , Width , Weight , "Запись ВГХ. Ошибка получения упаковки из рс ШтрихкодыОбъектовХранения." );
				КонецПопытки;
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыНоменклатуры Тогда
				ОбъектХранения = Результат.Номенклатура.ПолучитьОбъект(); 
				ОбъектХранения[стзМетодыХранения.Свойство_ИмяРеквизита] = сткВходныеПараметры[стзМетодыХранения.ИмяСвойства];
				ОбъектХранения.Записать();
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыНоменклатуры Тогда
				ОбъектХранения = Результат.Номенклатура.ПолучитьОбъект();
				ЗаписатьДопРевизит(ОбъектХранения, стзМетодыХранения.Свойство_ИмяРеквизита, сткВходныеПараметры[стзМетодыХранения.ИмяСвойства]);			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыХарактеристики Тогда
				ОбъектХранения.Записать();
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыХарактеристики Тогда
				Если ЗначениеЗаполнено(Результат.Характеристика) Тогда
					ОбъектХранения = Результат.Характеристика.ПолучитьОбъект(); 
				Иначе 
					ОбъектХранения = Результат.Номенклатура.ПолучитьОбъект();
				КонецЕсли;
				ЗаписатьДопРевизит(ОбъектХранения, стзМетодыХранения.Свойство_ИмяРеквизита, сткВходныеПараметры[стзМетодыХранения.ИмяСвойства]);
				ОбъектХранения.Записать();
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопСведенияНоменклатуры Тогда
				РС = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				РС.Объект = Результат.Номенклатура; 
				РС.Свойство = стзМетодыХранения.Свойство_ИмяРеквизита;
				РС.Значение = сткВходныеПараметры[стзМетодыХранения.ИмяСвойства];
				РС.Записать();	
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопСведенияХарактеристики Тогда
				РС = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				Если ЗначениеЗаполнено(Результат.Характеристика) Тогда
					РС.Объект = Результат.Характеристика; 
				Иначе 
					РС.Объект = Результат.Номенклатура;
				КонецЕсли;
				
				РС.Свойство = стзМетодыХранения.Свойство_ИмяРеквизита;
				РС.Значение = сткВходныеПараметры[стзМетодыХранения.ИмяСвойства];	
				РС.Записать();	
			КонецЕсли;
				
				
		КонецЦикла;
		Status = "OK";
		Comment = Строка(Результат.ОбъектХранения); 
	Иначе
		Status = "ER";
		Comment = "Штрихкод не найден"; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки) И Настройки.Логирование Тогда
		ЗаписатьЛог(Barcode, Length , Height , Width , Weight , "Запись ВГХ. " +  Status + ". -" + Comment);
	КонецЕсли;
	Возврат "";
КонецФункции  

Процедура ЗаписатьДопРевизит(ОбъектЗаписи, ДопРеквизит, Значение)
		   СтрДопРек = ОбъектЗаписи.ДополнительныеРеквизиты.Найти(ДопРеквизит,"Свойство");
		   Если ЗначениеЗаполнено(СтрДопРек)Тогда
			   СтрДопРек.Значение = Значение; 
		   Иначе
			   СтрДопРек = ОбъектЗаписи.ДополнительныеРеквизиты.Добавить();
			   СтрДопРек.Свойство = ДопРеквизит;
			   СтрДопРек.Значение = Значение;
		   КонецЕсли;
		   ОбъектЗаписи.Записать();
КонецПроцедуры

Функция ПолучитьУпаковкуИзСоответствияУпаковкам(Номенклатура, стрНастроек)
	Если Не ЗначениеЗаполнено(стрНастроек) Тогда
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдИзм И 
	|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Номенклатура); 
	Запрос.УстановитьПараметр("ЕдИзм", стрНастроек.ЕдиницаИзмерения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(); 
	КонецЕсли;  
КонецФункции
	
Процедура ЗаписатьЛог(Barcode, Length = 0, Height = 0, Width = 0, Weight = 0, Событие)
	РС = РегистрыСведений.isc_ЛогСобытий.СоздатьМенеджерЗаписи();
	РС.Дата 		= ТекущаяДата();
	РС.Событие 		= Событие;
	РС.Штрихкод 	= Barcode;
	РС.Длина 		= Length;
	РС.Ширина 		= Width;
	РС.Высота 		= Height;
	РС.Масса 		= Weight;
	РС.Записать();
КонецПроцедуры
